# PatternMirrorForDivisionRule Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PatternMirrorForDivisionRule Property
ParameterTypeId Class See Also
---
"Mirror"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PatternMirrorForDivisionRule { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PatternMirrorForDivisionRule As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PatternMirrorForDivisionRule {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace